/**
 * display in console（在控制台显示）
 * @param {string} env
 */
export default function displayInConsole(env) {
  if (process.env.NODE_ENV !== env) {
    return;
  }

  window.console.log(
    `%c
  .---.          ,-----.     ,---.  ,---.     .-''-.
  | ,_|        .'  .-,  '.   |   /  |   |   .'_ _   \\
,-./  )       / ,-.|  \\ _ \\  |  |   |  .'  / ( \` )   '
\\  '_ '\`)    ;  \\  '_ /  | : |  | _ |  |  . (_ o _)  |
 > (_)  )    |  _\`,/ \\ _/  | |  _( )_  |  |  (_,_)___|
(  .  .-'    : (  '\\_/ \\   ; \\ (_ o._) /  '  \\   .---.
 \`-'\`-'|___   \\ \`"/  \\  ) /   \\ (_,_) /    \\  \`-'    /
  |        \\   '. \\_/\`\`".'     \\     /      \\       /
  \`--------\`     '-----'        \`---\`        \`'-..-'

`,
    "color: pink"
  );
}
